app/views/interviews/index.html.haml

	-# from outer space
	- if @qs.interviews.empty?
		.widget.widget-table.action-table
			.widget-header
				.icon.icon.th.list
---
SELECT `interviews`.* FROM `interviews`