app/views/interviews/show.html.haml

SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = ? LIMIT 1  [["id", "1"]]
---
.span12
	- if @interview.answers.empty?
		.widget.interview-widget
			.widget-header
				.icon.icon-star
			.widget-content.answer