app/controllers/interviews_controller.rb

SELECT `interviews`.* FROM `interviews`
---
  def index
    @interviews = Interview.all

SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @interview = Interview.find(params[:id])

SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @interview = Interview.find(params[:id])

INSERT INTO `interviews` (`created_at`, `name`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?)  [["created_at", Wed, 29 Jun 2011 01:07:33 UTC +00:00], ["name", "First Interview"], ["updated_at", Wed, 29 Jun 2011 01:07:33 UTC +00:00], ["user_id", 0]]
---
  def create
    @interview = current_user.interviews.build(params[:interview])

    respond_to do |format|
      if @interview.save