app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = ? LIMIT 1  [["id", "1"]]
---
    def show
        @question = Question.find(params[:id])

INSERT INTO `questions` (`created_at`, `response_matches`, `subtitle`, `title`, `updated_at`) VALUES (?, ?, ?, ?, ?)
---
    def create
        @question = Question.new(params[:question])

        respond_to do |format|
            if @question.save